/// Напишете програма, която по въведени две числа
/// изкарва на стандартния изход частното и остатъка
/// при делението на двете числа.

#include <iostream>

using namespace std;

int main() {

	// Декларация на променливитe.
	int num, divisor;

	// Извеждаме подканващо съобщение и четем от конзолата двете променливи.
	cout << "Please enter an integer: ";
	cin >> num;
	cout << "Please enter a non-zero divisor: ";
	cin >> divisor;

	// Извеждаме целочислено разделяне на променливите.
	cout << "Whole division: " << num / divisor << endl;

	// Извеждаме остатъка при деление на променливите.
	cout << "Remainder: " << num % divisor << endl;

	// Забележка 1: endl e манипулатор представляващ нов ред.
	// Забележка 2: Програмата ще даде грешка ако въведем 0 като второ число!

	return 0;
}
